# Exercise 02 -  OLAP Cubes - Slicing and Dicing

All the databases table in this demo are based on public database samples and transformations
- `Sakila` is a sample database created by `MySql` [Link](https://video.udacity-data.com/topher/2021/August/61120e06_pagila-3nf/pagila-3nf.png)
- The postgresql version of it is called `Pagila` [Link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design is based on O'Reilly's public dimensional modelling tutorial schema [Link](https://video.udacity-data.com/topher/2021/August/61120d38_pagila-star/pagila-star.png)

Start by creating and connecting to the database by running the cells below.

In [1]:
!PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila_star
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila_star -f Data/pagila-star.sql

 set_config
------------

(1 row)

 setval
--------
    200
(1 row)

 setval
--------
    605
(1 row)

 setval
--------
     16
(1 row)

 setval
--------
    600
(1 row)

 setval
--------
    109
(1 row)

 setval
--------
    599
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
      1
(1 row)

 setval
--------
  32098
(1 row)

 setval
--------
   1000
(1 row)

 setval
--------
   4581
(1 row)

 setval
--------
      6
(1 row)

 setval
--------
  32098
(1 row)

 setval
--------
  16049
(1 row)

 setval
--------
      2
(1 row)

 setval
--------
      2
(1 row)

### Connect to the local database where Pagila is loaded

In [2]:
import sql
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila_star'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

postgresql://student:student@127.0.0.1:5432/pagila_star

'Connected: student@pagila_star'

### Star Schema

<img src="pagila-star.png" width="50%"/>

# Start with a simple cube
TODO: Write a query that calculates the revenue (sales_amount) by day, rating, and city. Remember to join with the appropriate dimension tables to replace the keys with the dimension labels. Sort by revenue in descending order and limit to the first 20 rows. The first few rows of your output should match the table below.

In [13]:
%%time
%%sql

SELECT dd.day, dm.rating, ds.city, sum(f.sales_amount) AS revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
JOIN dimmovie dm ON f.movie_key = dm.movie_key
JOIN dimcustomer ds ON f.customer_key = ds.customer_key
GROUP BY dd.day, dm.rating, ds.city
ORDER BY revenue DESC LIMIT 20

 * postgresql://student:***@127.0.0.1:5432/pagila_star
20 rows affected.
CPU times: user 4.38 ms, sys: 0 ns, total: 4.38 ms
Wall time: 42.1 ms

[(30, 'G', 'San Bernardino', 49.94),
 (30, 'NC-17', 'Apeldoorn', 47.9),
 (21, 'NC-17', 'Belm', 45.94),
 (28, 'R', 'Mwanza', 43.94),
 (21, 'G', 'Citt del Vaticano', 43.94),
 (30, 'PG-13', 'Zanzibar', 43.94),
 (1, 'R', 'Qomsheh', 39.94),
 (22, 'R', 'Yangor', 39.94),
 (28, 'PG-13', 'Dhaka', 39.94),
 (17, 'G', 'Rajkot', 39.94),
 (19, 'PG', 'Najafabad', 39.92),
 (30, 'R', 'Fengshan', 39.9),
 (21, 'G', 'Wroclaw', 37.96),
 (28, 'PG', 'So Leopoldo', 37.96),
 (1, 'NC-17', 'Memphis', 37.94),
 (29, 'PG-13', 'Shimoga', 37.94),
 (19, 'PG', 'Sokoto', 37.94),
 (30, 'PG-13', 'Osmaniye', 37.94),
 (30, 'G', 'Omdurman', 37.94),
 (21, 'PG-13', 'Asuncin', 37.9)]

<div class="p-Widget jp-RenderedHTMLCommon jp-RenderedHTML jp-mod-trusted jp-OutputArea-output jp-OutputArea-executeResult" data-mime-type="text/html"><table>
    <tbody><tr>
        <th>day</th>
        <th>rating</th>
        <th>city</th>
        <th>revenue</th>
    </tr>
    <tr>
        <td>30</td>
        <td>G</td>
        <td>San Bernardino</td>
        <td>24.97</td>
    </tr>
    <tr>
        <td>30</td>
        <td>NC-17</td>
        <td>Apeldoorn</td>
        <td>23.95</td>
    </tr>
    <tr>
        <td>21</td>
        <td>NC-17</td>
        <td>Belm</td>
        <td>22.97</td>
    </tr>
    <tr>
        <td>30</td>
        <td>PG-13</td>
        <td>Zanzibar</td>
        <td>21.97</td>
    </tr>
    <tr>
        <td>28</td>
        <td>R</td>
        <td>Mwanza</td>
        <td>21.97</td>
    </tr>
</tbody></table></div>

## Slicing

Slicing is the reduction of the dimensionality of a cube by 1 e.g. 3 dimensions to 2, fixing one of the dimensions to a single value. In the example above, we have a 3-dimensional cube on day, rating, and country.

TODO: Write a query that reduces the dimensionality of the above example by limiting the results to only include movies with a `rating` of "PG-13". Again, sort by revenue in descending order and limit to the first 20 rows. The first few rows of your output should match the table below.

In [15]:
%%time
%%sql

SELECT dd.day, dm.rating, ds.city, sum(f.sales_amount) AS revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
JOIN dimmovie dm ON f.movie_key = dm.movie_key
JOIN dimcustomer ds ON f.customer_key = ds.customer_key
WHERE dm.rating = 'PG-13'
GROUP BY dd.day, dm.rating, ds.city
ORDER BY revenue DESC LIMIT 20

 * postgresql://student:***@127.0.0.1:5432/pagila_star
20 rows affected.
CPU times: user 1.34 ms, sys: 3.4 ms, total: 4.73 ms
Wall time: 20.9 ms

[(30, 'PG-13', 'Zanzibar', 43.94),
 (28, 'PG-13', 'Dhaka', 39.94),
 (29, 'PG-13', 'Shimoga', 37.94),
 (30, 'PG-13', 'Osmaniye', 37.94),
 (21, 'PG-13', 'Asuncin', 37.9),
 (21, 'PG-13', 'Parbhani', 35.96),
 (20, 'PG-13', 'Baha Blanca', 35.96),
 (30, 'PG-13', 'Nagareyama', 35.96),
 (30, 'PG-13', 'Tanauan', 35.92),
 (17, 'PG-13', 'Ikerre', 35.9),
 (30, 'PG-13', 'Zhoushan', 33.96),
 (30, 'PG-13', 'Yerevan', 33.94),
 (30, 'PG-13', 'Newcastle', 33.94),
 (20, 'PG-13', 'Santa Rosa', 31.96),
 (17, 'PG-13', 'Yantai', 31.96),
 (8, 'PG-13', 'Pontianak', 31.96),
 (30, 'PG-13', 'Santa Rosa', 31.96),
 (1, 'PG-13', 'Moscow', 31.94),
 (20, 'PG-13', 'Johannesburg', 31.94),
 (30, 'PG-13', 'Toulouse', 31.94)]

<div class="p-Widget jp-RenderedHTMLCommon jp-RenderedHTML jp-mod-trusted jp-OutputArea-output jp-OutputArea-executeResult" data-mime-type="text/html"><table>
    <tbody><tr>
        <th>day</th>
        <th>rating</th>
        <th>city</th>
        <th>revenue</th>
    </tr>
    <tr>
        <td>30</td>
        <td>PG-13</td>
        <td>Zanzibar</td>
        <td>21.97</td>
    </tr>
    <tr>
        <td>28</td>
        <td>PG-13</td>
        <td>Dhaka</td>
        <td>19.97</td>
    </tr>
    <tr>
        <td>29</td>
        <td>PG-13</td>
        <td>Shimoga</td>
        <td>18.97</td>
    </tr>
    <tr>
        <td>30</td>
        <td>PG-13</td>
        <td>Osmaniye</td>
        <td>18.97</td>
    </tr>
    <tr>
        <td>21</td>
        <td>PG-13</td>
        <td>Asuncin</td>
        <td>18.95</td>
    </tr>
</tbody></table></div>

## Dicing
Dicing is creating a subcube with the same dimensionality but fewer values for  two or more dimensions. 

TODO: Write a query to create a subcube of the initial cube that includes moves with:
* ratings of PG or PG-13
* in the city of Bellevue or Lancaster
* day equal to 1, 15, or 30

The first few rows of your output should match the table below.

In [16]:
%%time
%%sql

SELECT dd.day, dm.rating, ds.city, sum(f.sales_amount) AS revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
JOIN dimmovie dm ON f.movie_key = dm.movie_key
JOIN dimcustomer ds ON f.customer_key = ds.customer_key
WHERE dm.rating in ('PG', 'PG-13') AND ds.city in ('Bellevue','Lancaster'] AND dd.day in [1, 15, 30]
GROUP BY dd.day, dm.rating, ds.city
ORDER BY revenue DESC LIMIT 20

 * postgresql://student:***@127.0.0.1:5432/pagila_star
(psycopg2.ProgrammingError) syntax error at or near "["
LINE 6: WHERE dm.rating in ['PG', 'PG-13'] AND ds.city in ['Bellevue...
                           ^
 [SQL: "SELECT dd.day, dm.rating, ds.city, sum(f.sales_amount) AS revenue\nFROM factsales f\nJOIN dimdate dd ON f.date_key = dd.date_key\nJOIN dimmovie dm ON f.movie_key = dm.movie_key\nJOIN dimcustomer ds ON f.customer_key = ds.customer_key\nWHERE dm.rating in ['PG', 'PG-13'] AND ds.city in ['Bellevue','Lancaster'] AND dd.day in [1, 15, 30]\nGROUP BY dd.day, dm.rating, ds.city\nORDER BY revenue DESC LIMIT 20"]
CPU times: user 4.97 ms, sys: 184 Âµs, total: 5.15 ms
Wall time: 8.22 ms

<div class="p-Widget jp-RenderedHTMLCommon jp-RenderedHTML jp-mod-trusted jp-OutputArea-output jp-OutputArea-executeResult" data-mime-type="text/html"><table>
    <tbody><tr>
        <th>day</th>
        <th>rating</th>
        <th>city</th>
        <th>revenue</th>
    </tr>
    <tr>
        <td>30</td>
        <td>PG</td>
        <td>Lancaster</td>
        <td>12.98</td>
    </tr>
    <tr>
        <td>1</td>
        <td>PG-13</td>
        <td>Lancaster</td>
        <td>5.99</td>
    </tr>
    <tr>
        <td>30</td>
        <td>PG-13</td>
        <td>Bellevue</td>
        <td>3.99</td>
    </tr>
    <tr>
        <td>30</td>
        <td>PG-13</td>
        <td>Lancaster</td>
        <td>2.99</td>
    </tr>
    <tr>
        <td>15</td>
        <td>PG-13</td>
        <td>Bellevue</td>
        <td>1.98</td>
    </tr>
</tbody></table></div>